---
kind: enumMember
id: F:Autodesk.Revit.DB.Macros.MacroLevel.Application
enum: Autodesk.Revit.DB.Macros.MacroLevel
source: html/e67ee9d3-a083-a01c-e4e3-e8441544d580.htm
---
# Autodesk.Revit.DB.Macros.MacroLevel.Application

The application Macro.